/**
  ******************************************************************************
  * @file    supp/nvic.c 
  * @author  lisck
  * @version V1.0.1
  * @date    2016-02-18
  * @brief   
  ******************************************************************************
  * @attention
  *  本演示部分代码，全部由  lisck 编写完成，请勿用于商业用途
  *  如遇到任何 技术问题 ，请 访问 http://www.lincy.cn  留言板留言
  *  QQ : 2318006530
  *  Email :  1@lincy.cn
  *
  ******************************************************************************
  */  


//  _Includes 

#include "conf.h"

//  _Defines



//  _Declare 



/* -----------------------------  中断分组设置  -------------------------------*/

//设置NVIC中断分组2
//2位抢占优先级，2位子优先级
void NVIC_Config(void)
{
  
    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);	
                                                    
}









/* -------------------------------  end code  --------------------------------*/
